# filter

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    'gruplar' : ['A', 'B', 'C', 'A', 'B', 'C'],
    'degisken1' : [10, 23, 33, 22, 11, 99],
    'degisken2' : [100, 253, 333, 263, 111, 969]
})
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        263
4       B         11        111
5       C         99        969

In [3]:
def func(x):
    return x['degisken1'].std() > 9

In [4]:
df.groupby('gruplar').filter(func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

# transform

In [5]:
import pandas as pd
import numpy as np

In [6]:
df = pd.DataFrame({
    'gruplar' : ['A', 'B', 'C', 'A', 'B', 'C'],
    'degisken1' : [10, 23, 33, 23, 11, 99],
    'degisken2' : [100, 253, 333, 262, 111, 969]
})
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         23        262
4       B         11        111
5       C         99        969

In [7]:
df_a = df.iloc[:, 1:3]
df_a

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         23        262
4         11        111
5         99        969

In [8]:
df_a.transform(lambda x : (x - x.mean()) / x.std())

   degisken1  degisken2
0  -0.694171  -0.738461
1  -0.304636  -0.263736
2  -0.004994  -0.015514
3  -0.304636  -0.235811
4  -0.664207  -0.704331
5   1.972644   1.957853

Burada dikkat edilmesi gereken en önemli şey x değişkeninin hangi değerler aldığıdır yine hocalar bunu anlatamadı. Ama biz yine mantığını çözdük :D x columnlar listesi veya arrayi üzerinde geziniyor ve her column verisi üzerinde matematiksel işlemler gerçekleştiriyor yani degisken1 column' ı bildiğimiz gibi bir seri ver serilerde toplama çıkarma vesayre yapabiliyorduk buradaki işlemde bu x serisinden x' serisinin ortalamasını çıkartıcaz.